{
  "id": "shazamkit",
  "title": "ShazamKit",
  "category": "Technologies",
  "subcategory": null,
  "url": "https://developer.apple.com/design/human-interface-guidelines/shazamkit",
  "fetchedAt": "2025-11-25T20:55:22.499649",
  "abstract": "ShazamKit supports audio recognition by matching an audio sample against the ShazamKit catalog or a custom audio catalog.",
  "sections": [
    {
      "heading": "",
      "level": 0,
      "content": [
        {
          "type": "paragraph",
          "text": "![technologies-ShazamKit-intro.png]"
        },
        {
          "type": "paragraph",
          "text": "You can use ShazamKit to provide features like:"
        },
        {
          "type": "list",
          "items": [
            "Enhancing experiences with graphics that correspond with the genre of currently playing music",
            "Making media content accessible to people with hearing disabilities by providing closed captions or sign language that syncs with the audio",
            "Synchronizing in-app experiences with virtual content in contexts like online learning and retail"
          ]
        },
        {
          "type": "paragraph",
          "text": "If you need the device microphone to get audio samples for your app to recognize, you must request access to it. As with all types of permission requests, it’s important to help people understand why you’re asking for access. For guidance, see [Privacy](/design/human-interface-guidelines/privacy)."
        },
        {
          "type": "paragraph",
          "text": "![shazamkit-mic-permission.png]"
        }
      ]
    },
    {
      "heading": "Best practices",
      "level": 2,
      "anchor": "Best-practices",
      "content": [
        {
          "type": "paragraph",
          "text": "After you receive permission to access the microphone for features that use ShazamKit, follow these guidelines."
        },
        {
          "type": "paragraph",
          "text": "**Stop recording as soon as possible.** When people allow your app to record audio for recognition, they don’t expect the microphone to stay on. To help preserve privacy, only record for as long as it takes to get the sample you need."
        },
        {
          "type": "paragraph",
          "text": "**Let people opt in to storing your app’s recognized songs to their iCloud library.** If your app can store recognized songs to iCloud, give people a way to first approve this action. Even though both the Music Recognition control and the Shazam app show your app as the source of the recognized song, people appreciate having control over which apps can store content in their library."
        }
      ]
    },
    {
      "heading": "Platform considerations",
      "level": 2,
      "anchor": "Platform-considerations",
      "content": [
        {
          "type": "paragraph",
          "text": "*No additional considerations for iOS, iPadOS, macOS, tvOS, visionOS, or watchOS.*"
        }
      ]
    },
    {
      "heading": "Resources",
      "level": 2,
      "anchor": "Resources",
      "content": []
    },
    {
      "heading": "Developer documentation",
      "level": 4,
      "anchor": "Developer-documentation",
      "content": [
        {
          "type": "paragraph",
          "text": "[ShazamKit](/documentation/ShazamKit)"
        }
      ]
    },
    {
      "heading": "Videos",
      "level": 4,
      "anchor": "Videos",
      "content": []
    }
  ],
  "relatedTopics": [],
  "platforms": []
}