{
  "id": "segmented-controls",
  "title": "Segmented controls",
  "category": "Components",
  "subcategory": "Selection and Input",
  "url": "https://developer.apple.com/design/human-interface-guidelines/segmented-controls",
  "fetchedAt": "2025-11-25T20:55:28.733397",
  "abstract": "A segmented control is a linear set of two or more segments, each of which functions as a button.",
  "sections": [
    {
      "heading": "",
      "level": 0,
      "content": [
        {
          "type": "paragraph",
          "text": "![components-segmented-control-intro.png]"
        },
        {
          "type": "paragraph",
          "text": "Within a segmented control, all segments are usually equal in width. Like buttons, segments can contain text or images. Segments can also have text labels beneath them (or beneath the control as a whole)."
        }
      ]
    },
    {
      "heading": "Best practices",
      "level": 2,
      "anchor": "Best-practices",
      "content": [
        {
          "type": "paragraph",
          "text": "A segmented control can offer a single choice or multiple choices. For example, in Keynote people can select only one segment in the alignment options control to align selected text. In contrast, people can choose multiple segments in the font attributes control to combine styles like bold, italics, and underline. The toolbar of a Keynote window also uses a segmented control to let people show and hide various editing panes within the main window area."
        },
        {
          "type": "paragraph",
          "text": "![segmented-control-one-choice.png]"
        },
        {
          "type": "paragraph",
          "text": "![segmented-control-multiple-choices.png]"
        },
        {
          "type": "paragraph",
          "text": "**Use a segmented control to provide closely related choices that affect an object, state, or view.** For example, a segmented control can help people switch between views in a toolbar. Avoid using a segmented control to offer actions, such as adding, removing, or editing content."
        },
        {
          "type": "paragraph",
          "text": "**Avoid crowding the control with too many segments.** Too many segments can be hard to parse and time-consuming to navigate. Aim for no more than about five to seven segments in a wide interface and no more than about five segments on iPhone."
        },
        {
          "type": "paragraph",
          "text": "**In general, keep segment size consistent.** When all segments have equal width, a segmented control feels balanced. To the extent possible, it’s best to keep icon and title widths consistent too."
        }
      ]
    },
    {
      "heading": "Content",
      "level": 2,
      "anchor": "Content",
      "content": [
        {
          "type": "paragraph",
          "text": "**Prefer using either text or images — not a mix of both — in a single segmented control.** Although individual segments can contain text labels or images, mixing the two in a single control can lead to a disconnected and confusing interface."
        },
        {
          "type": "paragraph",
          "text": "**As much as possible, use content with a similar size in each segment.** Because all segments typically have equal width, it doesn’t look good if content fills some segments but not others."
        },
        {
          "type": "paragraph",
          "text": "**Use nouns or noun phrases for segment labels.** Write text that describes each segment and uses [title-style capitalization](https://support.apple.com/guide/applestyleguide/c-apsgb744e4a3/web#apdca93e113f1d64). A segmented control that displays text labels doesn’t need introductory text."
        }
      ]
    },
    {
      "heading": "Platform considerations",
      "level": 2,
      "anchor": "Platform-considerations",
      "content": [
        {
          "type": "paragraph",
          "text": "*Not supported in watchOS.*"
        }
      ]
    },
    {
      "heading": "iOS, iPadOS",
      "level": 3,
      "anchor": "iOS-iPadOS",
      "content": [
        {
          "type": "paragraph",
          "text": "**Avoid using a segmented control in a toolbar.** [Toolbar](https://developer.apple.com/design/human-interface-guidelines/toolbars) items act on the current screen — they don’t let people switch contexts like segmented controls do."
        },
        {
          "type": "paragraph",
          "text": "![segmented-controls-phone-recents.png]"
        }
      ]
    },
    {
      "heading": "macOS",
      "level": 3,
      "anchor": "macOS",
      "content": [
        {
          "type": "paragraph",
          "text": "**Consider using introductory text to clarify the purpose of a segmented control.** When the control uses symbols or interface icons, you could also add a label below each segment to clarify its meaning. If your app includes tooltips, provide one for each segment in a segmented control."
        },
        {
          "type": "paragraph",
          "text": "**Use a tab view in the main window area — instead of a segmented control — for view switching.** A [tab view](https://developer.apple.com/design/human-interface-guidelines/tab-views) supports efficient view switching and is similar in appearance to a [box](https://developer.apple.com/design/human-interface-guidelines/boxes) combined with a segmented control. Consider using a segmented control to help people switch views in a toolbar or inspector pane."
        },
        {
          "type": "paragraph",
          "text": "![segmented-controls-mac-calendar.png]"
        },
        {
          "type": "paragraph",
          "text": "**Size custom interface icons appropriately based on the size of the control.** Use the following values for guidance."
        },
        {
          "type": "paragraph",
          "text": "![segmented-control-icons-regular.png]"
        },
        {
          "type": "paragraph",
          "text": "![segmented-control-icons-small.png]"
        },
        {
          "type": "paragraph",
          "text": "![segmented-control-icons-mini.png]"
        },
        {
          "type": "paragraph",
          "text": "**Consider supporting spring loading.** On a Mac equipped with a Magic Trackpad, spring loading lets people activate a segment by dragging selected items over it and force clicking without dropping the selected items. People can also continue dragging the items after a segment activates."
        }
      ]
    },
    {
      "heading": "tvOS",
      "level": 3,
      "anchor": "tvOS",
      "content": [
        {
          "type": "paragraph",
          "text": "**Consider using a split view instead of a segmented control on screens that perform content filtering.** People generally find it easy to navigate back and forth between content and filtering options using a split view. Depending on its placement, a segmented control may not be as easy to access."
        },
        {
          "type": "paragraph",
          "text": "**Avoid putting other focusable elements close to segmented controls.** Segments become selected when focus moves to them, not when people click them. Carefully consider where you position a segmented control relative to other interface elements. If other focusable elements are too close, people might accidentally focus on them when attempting to switch between segments."
        }
      ]
    },
    {
      "heading": "visionOS",
      "level": 3,
      "anchor": "visionOS",
      "content": [
        {
          "type": "paragraph",
          "text": "When people look at a segmented control that uses icons, the system displays a tooltip that contains the descriptive text you supply."
        }
      ]
    },
    {
      "heading": "Resources",
      "level": 2,
      "anchor": "Resources",
      "content": []
    },
    {
      "heading": "Related",
      "level": 4,
      "anchor": "Related",
      "content": [
        {
          "type": "paragraph",
          "text": "[Split views](/design/human-interface-guidelines/split-views)"
        }
      ]
    },
    {
      "heading": "Developer documentation",
      "level": 4,
      "anchor": "Developer-documentation",
      "content": [
        {
          "type": "paragraph",
          "text": "[segmented](/documentation/SwiftUI/PickerStyle/segmented) — SwiftUI"
        },
        {
          "type": "paragraph",
          "text": "[UISegmentedControl](/documentation/UIKit/UISegmentedControl) — UIKit"
        },
        {
          "type": "paragraph",
          "text": "[NSSegmentedControl](/documentation/AppKit/NSSegmentedControl) — AppKit"
        }
      ]
    },
    {
      "heading": "Change log",
      "level": 2,
      "anchor": "Change-log",
      "content": []
    }
  ],
  "relatedTopics": [],
  "platforms": []
}